import css from "./Faq.module.css";

export default function Faq() {
  const faqData = [
    {
      question: "У яких напрямах чи методах ви працюєте?",
      answer:
        "!!!!!!У своїй практиці я використовую методи з доведеною ефективністю, адаптуючи їх під ваші індивідуальні потреби.",
    },
    {
      question: "Скільки зазвичай триває сесія?",
      answer:
        "Індивідуальні сесії тривають 50 хвилин. Для нашої першої ознайомчої зустрічі ми можемо запланувати 75 хвилин, щоб у нас було достатньо часу для обговорення вашої історії та цілей.",
    },
    {
      question: "Як часто потрібно приходити на сесії?",
      answer:
        "Для досягнення стійкого результату стандартний формат — це зустрічі один раз на тиждень у фіксований час. У періоди гострої кризи ми можемо узгодити зустрічі двічі на тиждень.",
    },
    {
      question: "Які ваші правила скасування візиту?",
      answer:
        "Я прошу попереджати про скасування візиту щонайменше за 24 години. У разі пропуску зустрічі або її скасування менш ніж за 24 години, стягується повна вартість сесії.",
    },
  ];

  return (
    <section className={css.section}>
      <div className={css.container}>
        <div className={css.mainInfo}>
          <h2 className={css.title}>
            Часті <span className={css.italicWord}>питання</span>{" "}
          </h2>
          <p className={css.subtitle}>
            Перш ніж ми розпочнемо, ось кілька речей, які вам варто знати. Якщо
            у вас виникнуть інші запитання, будь ласка, сміливо ставте їх під
            час нашої консультації.
          </p>
        </div>

        <div className={css.grid}>
          {faqData.map((faq, index) => (
            <div key={index} className={css.faqItem}>
              <h3 className={css.question}>{faq.question}</h3>
              <p className={css.answer}>{faq.answer}</p>
            </div>
          ))}
        </div>
      </div>
    </section>
  );
}
